---
kind: enumMember
id: F:Autodesk.Revit.DB.ViewTemplateApplicationOption.AllParametersAndStickIfNone
enum: Autodesk.Revit.DB.ViewTemplateApplicationOption
source: html/e844d7b8-0e29-cd97-d6b4-36b57ba050fd.htm
---
# Autodesk.Revit.DB.ViewTemplateApplicationOption.AllParametersAndStickIfNone

Apply all parameters controlled by template and if none is currently assigned make it view template